#!/usr/bin/env python
# coding: utf-8

# # XAI 스터디 내용 정리
# 1. 블랙 박스 모델이라 부른다
# - 왜 그것을 했는가?
# - 왜 다른 것은 안 되는가?
# - 언제 그것이 성공하는가?
# - 언제 그것이 실패하는가?
# - 언제 결과를 신용할 수 있는가?
# - 어떻게 나는 오류를 수정할 수 있는가?
# 위의 의문들에 대해 답을 주기가 힘들다.
# 
# 2. 설명 가능성이 필요한 이유
# - 일반화하기 어렵다.- train set이 실무 데이터와 fit하다고 자신할 수 있는가?
# - 규제 준수, 책임 규명 및 공정성 확보 -ai 윤리
# - 모델 디버깅 및 개선
# - Human in the loop - 알고리즘과 상호작용하며 어떻게 반응할 지 예측 가능한가?
# - Adversarial Attack - Noise에 대해 방어할 수 있는가?
# - 새로운 지식에 대한 가설과 발견
# 
# 3. 편향의 종류
# - 데이터의 편향
# - 모델의 편향
# - 알고리즘의 편향
# 
# 4. XAI 기법 종류
# - 피처 중요도
# - 부분 의존성 플롯
# - LIME
# - SHARP
# 5. XAI가 주는 효과
# - 엔지니어의 결론 도출 및 error 수정
# - 비전문가의 해석 가능

# 
